SpenceKonde/DxCore/megaavr/variants/20pin-ddseries/pins_arduino.h
#define PIN_TCA0_WO0_INIT                 (PIN_PA0)
#define PIN_TCB0_WO_INIT                  (PIN_PA2)
#define PIN_TCB1_WO_INIT                  (PIN_PA3)
#define PIN_TCD0_WOA_INIT                 (PIN_PA4)


#define digitalPinHasPWM(p)               (digitalPinHasPWMTCB(p) || ((p) == PIN_PD4 || (p) == PIN_PD5) || ((p) > PIN_PA0 && (p) < PIN_PA6))

        /*##   ###  ####  ##### #   # #   # #   #
        #   # #   # #   #   #   ## ## #   #  # #
        ####  #   # ####    #   # # # #   #   #
        #     #   # #  #    #   #   # #   #  # #
        #      ###  #   #   #   #   #  ###  #   */

#define SPI_INTERFACES_COUNT              (1)

// In contrast to DA/DB with no pinswap options available, the DD has them in spades!
// defining SPI_MUX_PINSWAP_n is how we signal to SPI.h that a given option is valid
// for that part. PIN_PERIPHERALNSMR_

// SPI 0
#define SPI_MUX                           (0x00)
#define SPI_MUX_PINSWAP_4                 (0x04)
#define SPI_MUX_PINSWAP_5                 (0x05)
#define SPI_MUX_PINSWAP_6                 (0x06)
#define SPI_MUX_PINSWAP_NONE              (PORTMUX_SPI0_NONE_gc)
#define PIN_SPI_MOSI                      (PIN_PA4)
#define PIN_SPI_MISO                      (PIN_PA5)
#define PIN_SPI_SCK                       (PIN_PA6)
#define PIN_SPI_SS                        (PIN_PA7)
#define PIN_SPI_MOSI_PINSWAP_4            (PIN_PD4)
#define PIN_SPI_MISO_PINSWAP_4            (PIN_PD5)
#define PIN_SPI_SCK_PINSWAP_4             (PIN_PD6)
#define PIN_SPI_SS_PINSWAP_4              (PIN_PD7)
#define PIN_SPI_MOSI_PINSWAP_5            (PIN_PC0)
#define PIN_SPI_MISO_PINSWAP_5            (PIN_PC1)
#define PIN_SPI_SCK_PINSWAP_5             (PIN_PC2)
#define PIN_SPI_SS_PINSWAP_5              (PIN_PC3)
#define PIN_SPI_MOSI_PINSWAP_6            (PIN_PC1)
#define PIN_SPI_MISO_PINSWAP_6            (PIN_PC2)
#define PIN_SPI_SCK_PINSWAP_6             (PIN_PC3)
#define PIN_SPI_SS_PINSWAP_6              (PIN_PF7) //UPDI

// TWI 0
#define PIN_WIRE_SDA                      (PIN_PA2)
#define PIN_WIRE_SCL                      (PIN_PA3)
#define PIN_WIRE_SDA_PINSWAP_1            (PIN_PA2)
#define PIN_WIRE_SCL_PINSWAP_1            (PIN_PA3)
#define PIN_WIRE_SDA_PINSWAP_2            (PIN_PC2)
#define PIN_WIRE_SCL_PINSWAP_2            (PIN_PC3)
#define PIN_WIRE_SDA_PINSWAP_3            (PIN_PA0)
#define PIN_WIRE_SCL_PINSWAP_3            (PIN_PA1)
// USART 0
#define HWSERIAL0_MUX                     (0x00 /* PORTMUX_USART0_DEFAULT_gc */)
#define HWSERIAL0_MUX_PINSWAP_1           (0x01 /* PORTMUX_USART0_ALT1_gc */)
#define HWSERIAL0_MUX_PINSWAP_2           (0x02 /* PORTMUX_USART0_ALT2_gc */)
#define HWSERIAL0_MUX_PINSWAP_3           (0x03 /* PORTMUX_USART0_ALT3_gc */)
#define HWSERIAL0_MUX_PINSWAP_4           (0x04 /* PORTMUX_USART0_ALT4_gc */)
#define HWSERIAL0_MUX_PINSWAP_NONE        (0x05)
#define PIN_HWSERIAL0_TX                  (PIN_PA0)
#define PIN_HWSERIAL0_RX                  (PIN_PA1)
#define PIN_HWSERIAL0_XCK                 (PIN_PA2)
#define PIN_HWSERIAL0_XDIR                (PIN_PA3)
#define PIN_HWSERIAL0_TX_PINSWAP_1        (PIN_PA4)
#define PIN_HWSERIAL0_RX_PINSWAP_1        (PIN_PA5)
#define PIN_HWSERIAL0_XCK_PINSWAP_1       (PIN_PA6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1      (PIN_PA7)
#define PIN_HWSERIAL0_TX_PINSWAP_2        (PIN_PA2)
#define PIN_HWSERIAL0_RX_PINSWAP_2        (PIN_PA3)
#define PIN_HWSERIAL0_XCK_PINSWAP_2       (NOT_A_PIN)
#define PIN_HWSERIAL0_XDIR_PINSWAP_2      (NOT_A_PIN)
#define PIN_HWSERIAL0_TX_PINSWAP_3        (PIN_PD4)
#define PIN_HWSERIAL0_RX_PINSWAP_3        (PIN_PD5)
#define PIN_HWSERIAL0_XCK_PINSWAP_3       (PIN_PD6)
#define PIN_HWSERIAL0_XDIR_PINSWAP_3      (PIN_PD7)
#define PIN_HWSERIAL0_TX_PINSWAP_4        (PIN_PC1)
#define PIN_HWSERIAL0_RX_PINSWAP_4        (PIN_PC2)
#define PIN_HWSERIAL0_XCK_PINSWAP_4       (PIN_PC3)
#define PIN_HWSERIAL0_XDIR_PINSWAP_4      (NOT_A_PIN)


// USART1
#define HWSERIAL1_MUX                     (0x00 /* PORTMUX_USART1_DEFAULT_gc */)
#define HWSERIAL1_MUX_PINSWAP_2           (0x02 << 3 /* PORTMUX_USART1_ALT2_gc */)
#define HWSERIAL1_MUX_PINSWAP_NONE        (0x03 << 2 /* PORTMUX_USART1_NONE_gc */)
#define PIN_HWSERIAL1_TX                  (NOT_A_PIN)
#define PIN_HWSERIAL1_RX                  (PIN_PC1)
#define PIN_HWSERIAL1_XCK                 (PIN_PC2)
#define PIN_HWSERIAL1_XDIR                (PIN_PC3)
#define PIN_HWSERIAL1_TX_PINSWAP_2        (PIN_PD6)
#define PIN_HWSERIAL1_RX_PINSWAP_2        (PIN_PD7)
#define PIN_HWSERIAL1_XCK_PINSWAP_2       (NOT_A_PIN)
#define PIN_HWSERIAL1_XDIR_PINSWAP_2      (NOT_A_PIN)

        /*##  #   #  ###  #     ###   ###      ####  ### #   #  ###
        #   # ##  # #   # #    #   # #         #   #  #  ##  # #
        ##### # # # ##### #    #   # #  ##     ####   #  # # #  ###
        #   # #  ## #   # #    #   # #   #     #      #  #  ##     #
        #   # #   # #   # ####  ###   ###      #     ### #   #  #*/

#define PIN_A0             (NOT_A_PIN) /* Doesn't exist on DD-series */
#define PIN_A1             (NOT_A_PIN) // no PD1, 2, or 3 either.
#define PIN_A2             (NOT_A_PIN)
#define PIN_A3             (NOT_A_PIN)
#define PIN_A4             (PIN_PD4)
#define PIN_A5             (PIN_PD5)
#define PIN_A6             (PIN_PD6)
#define PIN_A7             (PIN_PD7)
#define PIN_A8             (NOT_A_PIN) // Under 48 pins -> no PORTE
#define PIN_A9             (NOT_A_PIN)
#define PIN_A10            (NOT_A_PIN)
#define PIN_A11            (NOT_A_PIN)
#define PIN_A12            (NOT_A_PIN)
#define PIN_A13            (NOT_A_PIN)
#define PIN_A14            (NOT_A_PIN)
#define PIN_A15            (NOT_A_PIN)
#define PIN_A16            (NOT_A_PIN) // No PF0~PF5, and PF6, PF7 don't have analog input (RESET and UPDI)
#define PIN_A17            (NOT_A_PIN)
#define PIN_A18            (NOT_A_PIN)
#define PIN_A19            (NOT_A_PIN)
#define PIN_A20            (NOT_A_PIN)
#define PIN_A21            (NOT_A_PIN)
#define PIN_A22            (PIN_PA2) // Now it wraps alllll the way around to the beginning - but starts counting from the third pin of PORTA, because the first 2 instead are used for crystal
#define PIN_A23            (PIN_PA3) // That apparently was enough to get them removed from the list of pins the deserve analog channels. Likely they wanted to avoid reusing channels numbers associated with PE/PF elsewhere, and had 32 mux positions to distribute,
#define PIN_A24            (PIN_PA4) // The crystal pins might pose particular technical challenges, and were right at one end of the range of analog-less pins, so they were natural choice to ditch.
#define PIN_A25            (PIN_PA5)
#define PIN_A26            (PIN_PA6)
#define PIN_A27            (PIN_PA7)
#define PIN_A28            (NOT_A_PIN)
#define PIN_A29            (PIN_PC1)
#define PIN_A30            (PIN_PC2)
#define PIN_A31            (PIN_PC3)

static const uint8_t A0  = NOT_A_PIN;
static const uint8_t A1  = NOT_A_PIN;
static const uint8_t A2  = NOT_A_PIN;
static const uint8_t A3  = NOT_A_PIN;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6;
static const uint8_t A7  = PIN_A7;
static const uint8_t A8  = NOT_A_PIN;
static const uint8_t A9  = NOT_A_PIN;
static const uint8_t A10 = NOT_A_PIN;
static const uint8_t A11 = NOT_A_PIN;
static const uint8_t A12 = NOT_A_PIN;
static const uint8_t A13 = NOT_A_PIN;
static const uint8_t A14 = NOT_A_PIN;
static const uint8_t A15 = NOT_A_PIN;
static const uint8_t A16 = NOT_A_PIN;
static const uint8_t A17 = NOT_A_PIN;
static const uint8_t A18 = NOT_A_PIN;
static const uint8_t A19 = NOT_A_PIN;
static const uint8_t A20 = NOT_A_PIN;
static const uint8_t A21 = NOT_A_PIN;
static const uint8_t A22 = PIN_A22;
static const uint8_t A23 = PIN_A23;
static const uint8_t A24 = PIN_A24;
static const uint8_t A25 = PIN_A25;
static const uint8_t A26 = PIN_A26;
static const uint8_t A27 = PIN_A27;
static const uint8_t A28 = NOT_A_PIN;
static const uint8_t A29 = PIN_A29;
static const uint8_t A30 = PIN_A30;
static const uint8_t A31 = PIN_A31;

#define AIN4               ADC_CH(4)
#define AIN5               ADC_CH(5)
#define AIN6               ADC_CH(6)
#define AIN7               ADC_CH(7)
#define AIN22              ADC_CH(22)
#define AIN23              ADC_CH(23)
#define AIN24              ADC_CH(24)
#define AIN25              ADC_CH(25)
#define AIN26              ADC_CH(26)
#define AIN27              ADC_CH(27)
#define AIN29              ADC_CH(29)
#define AIN30              ADC_CH(30)
#define AIN31              ADC_CH(31)


        /*##  ### #   #      ###  ####  ####   ###  #   #  ###
        #   #  #  ##  #     #   # #   # #   # #   #  # #  #
        ####   #  # # #     ##### ####  ####  #####   #    ###
        #      #  #  ##     #   # #  #  #  #  #   #   #       #
        #     ### #   #     #   # #   # #   # #   #   #    #*/

#ifdef ARDUINO_MAIN

const uint8_t digital_pin_to_port[] = {
  PA,         //  0 PA0/USART0_Tx/CLKIN
  PA,         //  1 PA1/USART0_Rx
  PA,         //  2 PA2/SDA
  PA,         //  3 PA3/SCL
  PA,         //  4 PA4/MOSI
  PA,         //  5 PA5/MISO
  PA,         //  6 PA6/SCK
  PA,         //  7 PA7/SS/CLKOUT/LED_BUILTIN
  NOT_A_PORT, //  8 PC0 NOT A PIN // Nothing depends on this
  PC,         //  9 PC1/USART1_Rx/TCA0 PWM
  PC,         // 10 PC2/TCA0 PWM
  PC,         // 11 PC3/TCA0 PWM
  PD,         // We give PD0 a number and specify it as being on PORTD because things depend on that because it is the zero pin and the origin of the analog inputs.
  NOT_A_PORT, // 13 PD1/AIN1
  NOT_A_PORT, // 14 PD2/AIN2
  NOT_A_PORT, // 15 PD3/AINN
  PD,         // 16 PD4/AIN4
  PD,         // 17 PD5/AIN5
  PD,         // 18 PD6/AIN6
  PD,         // 19 PD7/AIN7/AREF
  PF,         // 26 PF6 RESET
  PF          // 27 PF7 UPDI
};

